Problem 1 — Scaling head-to-head

In [37]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

 a) Compute the Standardization for both features by hand on the first three values only.

In [38]:
weight = [58, 62, 65, 66, 190]
height = [150, 160, 170, 175, 180]

In [39]:
w_array = np.array(weight)
h_array = np.array(height)

In [40]:
df = pd.DataFrame({"weight":weight,"height":height})
df

   weight  height
0      58     150
1      62     160
2      65     170
3      66     175
4     190     180

In [41]:
mean = df.mean()
std = df.std()
mean,std

(weight     88.2
 height    167.0
 dtype: float64,
 weight    56.992982
 height    12.041595
 dtype: float64)

In [42]:
df[["Z_scale_weight", "Z_Scale_height"]] = (df - mean) / std
df

   weight  height  Z_scale_weight  Z_Scale_height
0      58     150       -0.529890       -1.411773
1      62     160       -0.459706       -0.581318
2      65     170       -0.407068        0.249136
3      66     175       -0.389522        0.664364
4     190     180        1.786185        1.079591

 b) Compute Min–Max Scaling to [0, 1] for all values.

In [43]:
main_keys = ["weight","height"];
mn = df[main_keys].min()
mx = df[main_keys].max()
mn,mx
df[["mm_Scale_weight","mm_Scale_height"]] = (df[main_keys] - mn)/(mx - mn)
df

,weight,height,Z_scale_weight,Z_Scale_height,mm_Scale_weight,mm_Scale_height
0,58,150,-0.529890,-1.411773,0.000000,0.000000
1,62,160,-0.459706,-0.581318,0.030303,0.333333
2,65,170,-0.407068,0.249136,0.053030,0.666667
3,66,175,-0.389522,0.664364,0.060606,0.833333
4,190,180,1.786185,1.079591,1.000000,1.000000

 c) Compute Robust Scaling for Weight_kg using median and IQR.

In [44]:
median = df["weight"].median()
q1 = df["weight"].quantile(.25)
q3 = df["weight"].quantile(.75)
iqr = q3 - q1
df["Robust_Scale_weight"] = (df["weight"] - median)/iqr
df

,weight,height,Z_scale_weight,Z_Scale_height,mm_Scale_weight,mm_Scale_height,Robust_Scale_weight
0,58,150,-0.529890,-1.411773,0.000000,0.000000,-1.75
1,62,160,-0.459706,-0.581318,0.030303,0.333333,-0.75
2,65,170,-0.407068,0.249136,0.053030,0.666667,0.00
3,66,175,-0.389522,0.664364,0.060606,0.833333,0.25
4,190,180,1.786185,1.079591,1.000000,1.000000,31.25

Problem 3 — Nominal vs Ordinal and encoding

In [45]:
data = pd.DataFrame({"City":["Dhaka","Sylhet","Khulna","Dhaka"],"Education_level":["High School","Bachelor","Masters","Bachelor"],"Satisfaction":["Low","Medium","High","Medium"]})
data

     City Education_level Satisfaction
0   Dhaka     High School          Low
1  Sylhet        Bachelor       Medium
2  Khulna         Masters         High
3   Dhaka        Bachelor       Medium

**Tasks**

 a) Mark which are nominal and which are ordinal.

In [46]:
nominal = ["City"]
ordinal = ["Education_level","Satisfaction"]

 b) One-hot encode City by hand for the 4 rows. Use 0 and 1.

In [47]:
data
ohe_city = pd.get_dummies(data["City"],prefix = "City",dtype=int)
data = pd.concat([data,ohe_city],axis=1)

In [48]:
data

     City Education_level Satisfaction  City_Dhaka  City_Khulna  City_Sylhet
0   Dhaka     High School          Low           1            0            0
1  Sylhet        Bachelor       Medium           0            0            1
2  Khulna         Masters         High           0            1            0
3   Dhaka        Bachelor       Medium           1            0            0

 c) Ordinal-encode Education_Level with High School=0, Bachelor=1, Master=2.

In [49]:
education_dict = {"High School":0,"Bachelor":1,"Masters":2}
data["Education_level_Encoded"] = data["Education_level"].map(education_dict)
data

,City,Education_level,Satisfaction,City_Dhaka,City_Khulna,City_Sylhet,Education_level_Encoded
0,Dhaka,High School,Low,1,0,0,0
1,Sylhet,Bachelor,Medium,0,0,1,1
2,Khulna,Masters,High,0,1,0,2
3,Dhaka,Bachelor,Medium,1,0,0,1

**Problem 4 — Vectors, dot product, norms**

Given vectors a = [3, −1, 2] and b = [4, 0, −2].

**Tasks:**

 a) Compute the dot product a·b by hand.

In [53]:
a = [3, -1, 2]
b = [4, 0, -2]
a = np.array(a)
b = np.array(b)

In [55]:
dot_ab = (a*b).sum()
print(dot_ab)
print(a@b)

8
8

 b) Compute L1 and L2 norms of a.

In [59]:
l1_norm_hand = np.sqrt(np.sum(a**2))
print(l1_norm_hand)
l2_norm_hand = np.sum(np.abs(a))
print(l2_norm_hand)

3.7416573867739413
6

In [56]:
l2_norm = np.linalg.norm(a)
l1_norm = np.linalg.norm(a,ord=1)
print(l1_norm)
print(l2_norm)

6.0
3.7416573867739413

Problem 5 — Euclidean vs Manhattan distance in practice

In [ ]:
points = [(2,3),(5,7),(2,10)]
p1 = [x[0] for x in points]
p2 = [x[1] for x in points]
arr1 = np.array(p1)
arr2 = np.array(p2)
arr1,arr2

(array([2, 5, 2]), array([ 3,  7, 10]))

 a) Compute Euclidean and Manhattan distances for all pairs by hand.

In [67]:
eu_d = np.sqrt(np.sum((arr1 - arr2)**2))
man_d = np.sum(np.abs(arr1 - arr2))
print(eu_d)
print(man_d)

8.306623862918075
11